#include <stdio.h>

void f(int *y, int *m, int *d, int x){
	int i;
	
	for (i=0;i<x;i++){
		*d+=1;
		if ((*d>31 && *m==1) || (*d>31 && *m==3) || (*d>31 && *m==7) || (*d>31 && *m==8) || (*d>31 && *m==10) || (*d>31 && *m==12)){
			*d -= 31;
			*m += 1;
		}
		else if ((*d>30 && *m==4) || (*d>30 && *m==6) || (*d>30 && *m==9) || (*d>30 && *m==11)){
			*d -= 30;
			*m += 1;
		}
		else if ((*y%400==0) && *m==2 && *d>29){
			*d -= 29;
			*m += 1;
		}
		else if ((*y%100==0) && *m==2 && *d>28){
			*d -= 28;
			*m += 1;
		}
		else if ((*y%4==0) && *m==2 && *d>29){
			*d -= 29;
			*m += 1;
		}
		else if (*m==2 && *d>28){
			*d -= 28;
			*m += 1;
		}
		if (*m > 12){
			*m = 1;
			*d = 1;
			*y += 1;
		}
	}
}

int main(void){
	int y=2020,m=9,d=10, x;
	scanf("%d",&x);
	f(&y,&m,&d,x);
	printf("%04d년 %02d월 %02d일 \n",y,m,d);
	return 0;
}

